AlmAck/svdtonuttx/demo/h/da1470x_pdc.h
/* PDC_CTRL13 Register */

#define PDC_PDC_MASTER_MASK                   (0x3 << 11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_PDC_MASTER_POS                    (11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_EN_SNC                            (1U << 10) /* If set, enables PD_SNC. This bit is implied when PDC_MASTER=SNC */
#define PDC_EN_TMR                            (1U << 8) /* If set, enables PD_TMR */
#define PDC_EN_XTAL                           (1U << 7) /* If set, the XTAL32M will be started */
#define PDC_TRIG_ID_MASK                      (0x1F << 2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_ID_POS                       (2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_SELECT_MASK                  (0x3 << 0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */
#define PDC_TRIG_SELECT_POS                   (0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */

/* PDC_CTRL14 Register */

#define PDC_PDC_MASTER_MASK                   (0x3 << 11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_PDC_MASTER_POS                    (11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_EN_SNC                            (1U << 10) /* If set, enables PD_SNC. This bit is implied when PDC_MASTER=SNC */
#define PDC_EN_TMR                            (1U << 8) /* If set, enables PD_TMR */
#define PDC_EN_XTAL                           (1U << 7) /* If set, the XTAL32M will be started */
#define PDC_TRIG_ID_MASK                      (0x1F << 2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_ID_POS                       (2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_SELECT_MASK                  (0x3 << 0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */
#define PDC_TRIG_SELECT_POS                   (0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */

/* PDC_CTRL15 Register */

#define PDC_PDC_MASTER_MASK                   (0x3 << 11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_PDC_MASTER_POS                    (11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_EN_SNC                            (1U << 10) /* If set, enables PD_SNC. This bit is implied when PDC_MASTER=SNC */
#define PDC_EN_TMR                            (1U << 8) /* If set, enables PD_TMR */
#define PDC_EN_XTAL                           (1U << 7) /* If set, the XTAL32M will be started */
#define PDC_TRIG_ID_MASK                      (0x1F << 2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_ID_POS                       (2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_SELECT_MASK                  (0x3 << 0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */
#define PDC_TRIG_SELECT_POS                   (0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */

/* PDC_CTRL1 Register */

#define PDC_PDC_MASTER_MASK                   (0x3 << 11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_PDC_MASTER_POS                    (11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_EN_SNC                            (1U << 10) /* If set, enables PD_SNC. This bit is implied when PDC_MASTER=SNC */
#define PDC_EN_TMR                            (1U << 8) /* If set, enables PD_TMR */
#define PDC_EN_XTAL                           (1U << 7) /* If set, the XTAL32M will be started */
#define PDC_TRIG_ID_MASK                      (0x1F << 2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_ID_POS                       (2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_SELECT_MASK                  (0x3 << 0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */
#define PDC_TRIG_SELECT_POS                   (0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */

/* PDC_CTRL2 Register */

#define PDC_PDC_MASTER_MASK                   (0x3 << 11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_PDC_MASTER_POS                    (11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_EN_SNC                            (1U << 10) /* If set, enables PD_SNC. This bit is implied when PDC_MASTER=SNC */
#define PDC_EN_TMR                            (1U << 8) /* If set, enables PD_TMR */
#define PDC_EN_XTAL                           (1U << 7) /* If set, the XTAL32M will be started */
#define PDC_TRIG_ID_MASK                      (0x1F << 2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_ID_POS                       (2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_SELECT_MASK                  (0x3 << 0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */
#define PDC_TRIG_SELECT_POS                   (0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */

/* PDC_CTRL3 Register */

#define PDC_PDC_MASTER_MASK                   (0x3 << 11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_PDC_MASTER_POS                    (11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_EN_SNC                            (1U << 10) /* If set, enables PD_SNC. This bit is implied when PDC_MASTER=SNC */
#define PDC_EN_TMR                            (1U << 8) /* If set, enables PD_TMR */
#define PDC_EN_XTAL                           (1U << 7) /* If set, the XTAL32M will be started */
#define PDC_TRIG_ID_MASK                      (0x1F << 2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_ID_POS                       (2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_SELECT_MASK                  (0x3 << 0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */
#define PDC_TRIG_SELECT_POS                   (0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */

/* PDC_CTRL4 Register */

#define PDC_PDC_MASTER_MASK                   (0x3 << 11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_PDC_MASTER_POS                    (11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_EN_SNC                            (1U << 10) /* If set, enables PD_SNC. This bit is implied when PDC_MASTER=SNC */
#define PDC_EN_TMR                            (1U << 8) /* If set, enables PD_TMR */
#define PDC_EN_XTAL                           (1U << 7) /* If set, the XTAL32M will be started */
#define PDC_TRIG_ID_MASK                      (0x1F << 2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_ID_POS                       (2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_SELECT_MASK                  (0x3 << 0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */
#define PDC_TRIG_SELECT_POS                   (0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */

/* PDC_CTRL5 Register */

#define PDC_PDC_MASTER_MASK                   (0x3 << 11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_PDC_MASTER_POS                    (11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_EN_SNC                            (1U << 10) /* If set, enables PD_SNC. This bit is implied when PDC_MASTER=SNC */
#define PDC_EN_TMR                            (1U << 8) /* If set, enables PD_TMR */
#define PDC_EN_XTAL                           (1U << 7) /* If set, the XTAL32M will be started */
#define PDC_TRIG_ID_MASK                      (0x1F << 2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_ID_POS                       (2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_SELECT_MASK                  (0x3 << 0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */
#define PDC_TRIG_SELECT_POS                   (0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */

