AlmAck/svdtonuttx/demo/h/da1470x_pdc.h
/* PDC_CTRL6 Register */

#define PDC_PDC_MASTER_MASK                   (0x3 << 11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_PDC_MASTER_POS                    (11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_EN_SNC                            (1U << 10) /* If set, enables PD_SNC. This bit is implied when PDC_MASTER=SNC */
#define PDC_EN_TMR                            (1U << 8) /* If set, enables PD_TMR */
#define PDC_EN_XTAL                           (1U << 7) /* If set, the XTAL32M will be started */
#define PDC_TRIG_ID_MASK                      (0x1F << 2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_ID_POS                       (2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_SELECT_MASK                  (0x3 << 0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */
#define PDC_TRIG_SELECT_POS                   (0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */

/* PDC_CTRL7 Register */

#define PDC_PDC_MASTER_MASK                   (0x3 << 11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_PDC_MASTER_POS                    (11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_EN_SNC                            (1U << 10) /* If set, enables PD_SNC. This bit is implied when PDC_MASTER=SNC */
#define PDC_EN_TMR                            (1U << 8) /* If set, enables PD_TMR */
#define PDC_EN_XTAL                           (1U << 7) /* If set, the XTAL32M will be started */
#define PDC_TRIG_ID_MASK                      (0x1F << 2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_ID_POS                       (2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_SELECT_MASK                  (0x3 << 0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */
#define PDC_TRIG_SELECT_POS                   (0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */

/* PDC_CTRL8 Register */

#define PDC_PDC_MASTER_MASK                   (0x3 << 11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_PDC_MASTER_POS                    (11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_EN_SNC                            (1U << 10) /* If set, enables PD_SNC. This bit is implied when PDC_MASTER=SNC */
#define PDC_EN_TMR                            (1U << 8) /* If set, enables PD_TMR */
#define PDC_EN_XTAL                           (1U << 7) /* If set, the XTAL32M will be started */
#define PDC_TRIG_ID_MASK                      (0x1F << 2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_ID_POS                       (2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_SELECT_MASK                  (0x3 << 0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */
#define PDC_TRIG_SELECT_POS                   (0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */

/* PDC_CTRL9 Register */

#define PDC_PDC_MASTER_MASK                   (0x3 << 11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_PDC_MASTER_POS                    (11) /* Chooses which master is triggered when waking up 0x0: entry is disabled. 0x1: PD */
#define PDC_EN_SNC                            (1U << 10) /* If set, enables PD_SNC. This bit is implied when PDC_MASTER=SNC */
#define PDC_EN_TMR                            (1U << 8) /* If set, enables PD_TMR */
#define PDC_EN_XTAL                           (1U << 7) /* If set, the XTAL32M will be started */
#define PDC_TRIG_ID_MASK                      (0x1F << 2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_ID_POS                       (2) /* For description, see PDC_CTRL0_REG.TRIG_ID */
#define PDC_TRIG_SELECT_MASK                  (0x3 << 0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */
#define PDC_TRIG_SELECT_POS                   (0) /* For description, see PDC_CTRL0_REG.TRIG_SELECT */

/* PDC_PENDING_CM33 Register */

#define PDC_PDC_PENDING_MASK                  (0xFFFF << 0) /* Indicates which IRQ ids are pending towards the CM33 */
#define PDC_PDC_PENDING_POS                   (0) /* Indicates which IRQ ids are pending towards the CM33 */

/* PDC_PENDING_CMAC Register */

#define PDC_PDC_PENDING_MASK                  (0xFFFF << 0) /* Indicates which IRQ ids are pending towards the CMAC */
#define PDC_PDC_PENDING_POS                   (0) /* Indicates which IRQ ids are pending towards the CMAC */

/* PDC_PENDING Register */

#define PDC_PDC_PENDING_MASK                  (0xFFFF << 0) /* Indicates which IRQ ids are pending */
#define PDC_PDC_PENDING_POS                   (0) /* Indicates which IRQ ids are pending */

/* PDC_PENDING_SNC Register */

#define PDC_PDC_PENDING_MASK                  (0xFFFF << 0) /* Indicates which IRQ ids are pending towards the SensorNodeController */
#define PDC_PDC_PENDING_POS                   (0) /* Indicates which IRQ ids are pending towards the SensorNodeController */

/* PDC_SET_PENDING Register */

#define PDC_PDC_SET_PENDING_MASK              (0x1F << 0) /* Writing to this field sets the PDC wake-up request and IRQ. The data controls wh */
#define PDC_PDC_SET_PENDING_POS               (0) /* Writing to this field sets the PDC wake-up request and IRQ. The data controls wh */

#endif /* __DA1470X_PDC_H */
